In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns

In [ ]:
titanic=sns.load_dataset('titanic')

In [ ]:
#To load the csv file
#We need to do
# df=pd.read_csv('File_name')

In [ ]:
#Data Preprocessing

In [ ]:
#Describing dataset
print(titanic.describe())

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
#Check for null values
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [ ]:
titanic.isnull().sum().sum()

np.int64(869)

In [ ]:
#datatypes
print(titanic.dtypes)

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [ ]:
#Variable info
print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         891 non-null    category
 12  embark_town  891 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
None

In [ ]:
#Dimension of datafram
titanic.shape

(891, 15)

In [ ]:
#Filling null values
titanic['age']=titanic['age'].fillna(titanic['age'].mean())
titanic['embarked']=titanic['embarked'].fillna(titanic['embarked'].mode()[0])
titanic['deck']=titanic['deck'].fillna(titanic['deck'].mode()[0])
titanic['embark_town']=titanic['embark_town'].fillna(titanic['embark_town'].mode()[0])

In [ ]:
titanic.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [ ]:
#Data standardization and normalization\
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [ ]:
titanic.sex=le.fit_transform(titanic.sex)

In [ ]:
print(titanic)

     survived  pclass  sex        age  sibsp  parch     fare embarked   class  \
0           0       3    1  22.000000      1      0   7.2500        S   Third
1           1       1    0  38.000000      1      0  71.2833        C   First
2           1       3    0  26.000000      0      0   7.9250        S   Third
3           1       1    0  35.000000      1      0  53.1000        S   First
4           0       3    1  35.000000      0      0   8.0500        S   Third
..        ...     ...  ...        ...    ...    ...      ...      ...     ...
886         0       2    1  27.000000      0      0  13.0000        S  Second
887         1       1    0  19.000000      0      0  30.0000        S   First
888         0       3    0  29.699118      1      2  23.4500        S   Third
889         1       1    1  26.000000      0      0  30.0000        C   First
890         0       3    1  32.000000      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True    C  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False    C  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True    C  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True    C  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False    C  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True    C   Queenstown    no   True

[891 rows x 15 columns]

In [ ]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()

In [ ]:
titanic[['age']]=scaler.fit_transform(titanic[['age']])

In [ ]:
print(titanic)

     survived  pclass  sex       age  sibsp  parch     fare embarked   class  \
0           0       3    1 -0.592481      1      0   7.2500        S   Third
1           1       1    0  0.638789      1      0  71.2833        C   First
2           1       3    0 -0.284663      0      0   7.9250        S   Third
3           1       1    0  0.407926      1      0  53.1000        S   First
4           0       3    1  0.407926      0      0   8.0500        S   Third
..        ...     ...  ...       ...    ...    ...      ...      ...     ...
886         0       2    1 -0.207709      0      0  13.0000        S  Second
887         1       1    0 -0.823344      0      0  30.0000        S   First
888         0       3    0  0.000000      1      2  23.4500        S   Third
889         1       1    1 -0.284663      0      0  30.0000        C   First
890         0       3    1  0.177063      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True    C  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False    C  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True    C  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True    C  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False    C  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True    C   Queenstown    no   True

[891 rows x 15 columns]